# This rule will tailor to Windows Event id 4104 log source.
title: PowerShell Script Block Logging via windows Event ID 4104
id: 2b3c4d5e-6f7g-8h9i-0j1k-2l3m4n5o6p7q
status: Experimental
description: |
  Detects PowerShell script block logging events via Windows Event ID 4104.
  Adversaries commonly use PowerShell for executing scripts and commands.
  Mainly built for revealing decoded values the attacker tried to obsfucate.
  Also centred around in memory based commands ie. IEX/ Invoke/ scriptBlock.
  
references:
  - https://attack.mitre.org/techniques/T1059/001/
author: William Richardson
date: 2026-06-20
modified: 2026-06-21
tags:
  - attack.execution
  - attack.t1059.001
logsource:
  product: windows
  category: powershell
detection:
  selection:
    EventID: 4104
  Filter_parent:
    HostApplication|endswith:
      - '\wmiprvse.exe'
      - '\winword.exe'
      - '\excel.exe'
      - '\powerpnt.exe'
      - '\outlook.exe'
      - '\mspub.exe'
      - '\wscript.exe'
      - '\cscript.exe'
      - '\mshta.exe'
      - '\regsvr32.exe'
      - '\rundll32.exe'
      - '\w3wp.exe'
      - '\sqlservr.exe'
    Filter_indicator:
      ScriptBlockText|contains:
        - 'IEX'
        - 'Invoke-Expression'
        - 'Invoke-Command'
        - 'Invoke-ScriptBlock'
        - 'Invoke-Item'
        - 'Invoke-WebRequest'
        - 'Invoke-RestMethod'
        - 'Start-BitsTransfer'
        - 'Net.WebClient'
        - '.DownloadString'
        - '.DownloadFile'
        - '.DownloadData'
        - '[Net.WebRequest]::Create'
        - 'Msxml2.XMLHTTP'
        - 'WinHttp.WinHttpRequest'
    condition: selection and Filter_parent or Filter_indicator
# Plan for selections etc:
# 1.  Need to decide breadth, the above could work as a starting point, 
# but may need to be expanded to include other indicators of evasion or in memory execution.
# Only question I have is if it's worth filtering by path and making two rule:
# 1. when path is empty (in memory execution)
# 2. when path is not empty (script file execution). 

# OR I could repeat same indicators from sys 1, just combinining the message blocks
# & analysts can now see whats decoded more easi;yly so its a better detection than sys1 technically.
falsepositives:
  - Legitimate PowerShell scripts executed by administrators or automated tasks
  - Security software or monitoring tools that utilize PowerShell for management
  - Developers running PowerShell scripts during development or testing
level: high